feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxCpu_regdef.h
/** \brief  CPU Identification Register TC1.6P */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPU_ID_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPU_ID;

/** \brief  CPU Code Protection Execute Enable Register Set */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_CPXE;

/** \brief  Core Register Access Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CREVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_CREVT;

/** \brief  CPU Customer ID register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CUS_ID_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CUS_ID;

/** \brief  Data General Purpose Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_D_Bits B;                       /**< \brief Bitfield access */
} Ifx_CPU_D;

/** \brief  Data Asynchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DATR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DATR;

/** \brief  Debug Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DBGSR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DBGSR;

/** \brief  Debug Trap Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DBGTCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DBGTCR;

/** \brief  Data Memory Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCON0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DCON0;

/** \brief  Data Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCON2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DCON2;

/** \brief  CPU Debug Context Save Area Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_DCX;

/** \brief  Data Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DEADD_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DEADD;

/** \brief  Data Integrity Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DIEAR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DIEAR;

/** \brief  Data Integrity Error Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DIETR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DIETR;

/** \brief  CPU Debug Monitor Start Address */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DMS_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_DMS;

/** \brief  CPU Data Protection Range, Lower Bound Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPR_L_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DPR_L;

/** \brief  CPU Data Protection Range, Upper Bound Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPR_U_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DPR_U;

/** \brief  CPU Data Protection Read Enable Register Set */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DPRE;

/** \brief  CPU Data Protection Write Enable Register Set */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DPWE;

/** \brief  Data Synchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DSTR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DSTR;

/** \brief  External Event Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_EXEVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_EXEVT;

