feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxCpu_regdef.h
/** \brief  Peripheral Space Identifier register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA2_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA2;

/** \brief  Program Synchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PSTR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PSTR;

/** \brief  Program Status Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PSW_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_PSW;

/** \brief  SRI Error Generation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SEGEN_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_SEGEN;

/** \brief  SIST Mode Access Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SMACON_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_SMACON;

/** \brief  CPU Safety Protection Register Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_ACCENA_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_SPROT_ACCENA;

/** \brief  CPU Safety Protection Region Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_ACCENB_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_SPROT_ACCENB;

/** \brief  CPU Safety Protection Region Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_RGN_ACCENA_Bits B;        /**< \brief Bitfield access */
} Ifx_CPU_SPROT_RGN_ACCENA;

/** \brief  CPU Safety Protection Region Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_RGN_ACCENB_Bits B;        /**< \brief Bitfield access */
} Ifx_CPU_SPROT_RGN_ACCENB;

/** \brief  CPU Safety Protection Region Lower Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_RGN_LA_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_SPROT_RGN_LA;

/** \brief  CPU Safety protection Region Upper Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPROT_RGN_UA_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_SPROT_RGN_UA;

/** \brief  Software Debug Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SWEVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_SWEVT;

/** \brief  System Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SYSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_SYSCON;

/** \brief  CPU Task Address Space Identifier Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TASK_ASI_Bits B;                /**< \brief Bitfield access */
} Ifx_CPU_TASK_ASI;

/** \brief  CPU Temporal Protection System Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_CON_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_TPS_CON;

/** \brief  CPU Temporal Protection System Timer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_TIMER_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_TPS_TIMER;

/** \brief  Trigger Address */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TR_ADR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_TR_ADR;

/** \brief  Trigger Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TR_EVT_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_TR_EVT;

/** \brief  CPU Trigger Address x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TRIG_ACC_Bits B;                /**< \brief Bitfield access */
} Ifx_CPU_TRIG_ACC;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

